# Criando Estruturas de Dados

In [55]:
import pandas as pd

## Series

In [56]:
data = [1,2,3,4,5]

In [57]:
s = pd.Series(data)

In [58]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [59]:
index = ['Linha ' + str(i) for i in range(5)]

In [60]:
s = pd.Series(data, index)

In [61]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [62]:
data = {'Linha ' + str(i) : i+1 for i in range (5)}

In [63]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [64]:
s = pd.Series(data)

In [65]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [66]:
s1 = s + 2

In [67]:
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [68]:
s2 = s + s1

In [69]:
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

## Dataframes

In [70]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [71]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [72]:
df1 = pd.DataFrame(data)

In [73]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [74]:
index = ['Linha ' + str(i) for i in range(3)]

In [75]:
columns = ['Coluna ' + str(i) for i in range(3)]

In [76]:
df1 = pd.DataFrame(data, index = index, columns=columns)

In [77]:
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [78]:
data = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
        'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
        'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [79]:
df2 = pd.DataFrame(data=data)

In [80]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [81]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [82]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [83]:
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

## Concatenação de DataFrames

In [84]:
df1[df1>0] = 'A'

In [85]:
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [86]:
df2[df2>0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [87]:
df3[df3>0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [88]:
df4 = pd.concat([df1,df2,df3])

In [89]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [90]:
df5 = pd.concat([df1,df2,df3], axis = 1)
df5

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C